In [1]:
import pandas as pd
import numpy as np

data = {'name' : ['Arik','Bob', 'Charlie'], 'age' : [16, 21, 28]}
df = pd.DataFrame(data)
df.head()

      name  age
0     Arik   16
1      Bob   21
2  Charlie   28

In [2]:
df['gender'] = 'male'

In [3]:
df.head()

      name  age gender
0     Arik   16   male
1      Bob   21   male
2  Charlie   28   male

In [4]:
df.loc[3] = ['Jane', 22, 'Female']
df.loc[4] = ['Rose', 36, 'Female']
df.head()

      name  age  gender
0     Arik   16    male
1      Bob   21    male
2  Charlie   28    male
3     Jane   22  Female
4     Rose   36  Female

In [5]:
grouped_df = df.groupby('gender')
grouped_df.describe()

         age
       count       mean       std   min   25%   50%   75%   max
gender
Female   2.0  29.000000  9.899495  22.0  25.5  29.0  32.5  36.0
male     3.0  21.666667  6.027714  16.0  18.5  21.0  24.5  28.0

In [6]:
grouped_df.agg({'age':'mean'})

              age
gender
Female  29.000000
male    21.666667

In [9]:
# Creating custom function to find the sum of the ages in the group

import numpy as np
def add_ages(aggre_age):
    return np.sum(aggre_age)

In [10]:
grouped_df.agg({'age':add_ages})

        age
gender
Female   58
male     65